Project/Toir/src/InformationRegisters/торо_Переводы/торо_Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Переводы</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.торо_Языки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/торо_ЛокализацияСобытияФорм/Module.bsl
#Область ПрограммныйИнтерфейс

// [Дописывается в обработчик ПриСоздании локализуемой формы элемента. Модифицирует реквизиты и элементы формы] 
Процедура ПриСоздании(ЭтаФорма, СтроковыеРеквизиты) Экспорт
	Языки = торо_Локализация.ПолучитьЯзыки();
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	МассивСтроковыхРеквизитов = СтрРазделить(СтроковыеРеквизиты, ",");
	
	ДобавлениеВспомогательныхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	Переводы = ПолучитьПереводыСтроковыхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	ЗаполнитьСтроковыеРеквизиты(Переводы, ЭтаФорма, Языки, ЯзыкПоУмолчанию);
	ЭлементыФормы = ПолучитьЭлелементыСтроковыхРеквизитов(МассивСтроковыхРеквизитов, ЭтаФорма);
	УстановитьДействияВыбора(ЭлементыФормы);
КонецПроцедуры

// [Дописывается в обработчик ПередЗаписьюНаСервере локализуемой формы элемента. Сохраняет переводы строк] 
Процедура ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	СтроковыеРеквизиты = СтрРазделить(ЭтаФорма.дс_СписокЛокализованныхРеквизитов, ",");
	
	Языки = торо_Локализация.ПолучитьЯзыки();
	ЯзыкПоУмолчанию = торо_Локализация.ТекущийЯзыкИБ();
	
	Переводы = Новый Массив;
	
	Для каждого Реквизит Из СтроковыеРеквизиты Цикл
		Для каждого Язык Из Языки Цикл
			Перевод = Новый Структура("Реквизит,Язык,Значение");
			Перевод.Язык = Язык.Ссылка;
			Перевод.Реквизит = Реквизит;
			
			Если Язык.Ссылка = ЯзыкПоУмолчанию Тогда
				Перевод.Значение = ЭтаФорма.Объект[Реквизит];
			Иначе
				НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
				Перевод.Значение = ЭтаФорма[НаименованиеРеквизита][Реквизит];
			КонецЕсли; 
			
			Переводы.Добавить(Перевод);
		КонецЦикла; 
	КонецЦикла; 
	
	ПараметрыЗаписи.Вставить("Переводы", Переводы);
КонецПроцедуры

// [Дописывается в обработчик ПослеЗаписиНаСервере локализуемой формы элемента. Записывает переводы строк] 
Процедура ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект = Неопределено, ПараметрыЗаписи, дс_Ссылка = Неопределено) Экспорт
	Переводы	= ПараметрыЗаписи.Переводы;
	Если дс_Ссылка = Неопределено Тогда 
		ID 			= ТекущийОбъект.Ссылка;
	Иначе
		ID = дс_Ссылка;
	КонецЕсли;
	
	Для каждого Перевод Из Переводы Цикл
		Язык 		= Перевод.Язык;
		Реквизит 	= Перевод.Реквизит;
		Текст 		= Перевод.Значение;
		
		Отбор = Новый Структура("ID,Язык,Реквизит,Текст", ID, Язык, Реквизит, Текст); 
		
		МенеджерЗаписиРегистраПереводов = РегистрыСведений.торо_Переводы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиРегистраПереводов, Отбор);
		МенеджерЗаписиРегистраПереводов.Записать();
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 


#Область Вспомогательное

Процедура ДобавлениеВспомогательныхРеквизитов(СтроковыеРеквизиты, ЭтаФорма, Языки, ЯзыкПоУмолчанию)
	ДобавляемыеРеквизиты = Новый Массив;
	
	СписокРеквизитов = Новый РеквизитФормы("дс_СписокЛокализованныхРеквизитов", Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(СписокРеквизитов);
	
	СписокСоставныхРеквизитов = Новый РеквизитФормы("дс_СоставныеРеквизиты", Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(СписокСоставныхРеквизитов);
	
	ПутиРеквизитов = Новый РеквизитФормы("дс_ПутиЛокализованныхРеквизитов", Новый ОписаниеТипов("Строка"));
	сПутиРеквизитов = Новый Соответствие;
	СоставныеРеквизиты = Новый Массив;
	
	МетаданныеРеквизитов = ЭтаФорма.Объект.Ссылка.Метаданные().Реквизиты;
	
	Для каждого Реквизит Из СтроковыеРеквизиты Цикл
		Для каждого Элемент Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
				Если Элемент.ПутьКДанным = СтрШаблон("Объект.%1", Реквизит) Тогда
					сПутиРеквизитов.Вставить(Элемент.Имя, Элемент.ПутьКДанным);
					Если МетаданныеРеквизитов.Найти(Реквизит) <> Неопределено Тогда
						Если МетаданныеРеквизитов[Реквизит].Тип.Типы().Количество() > 1 Тогда
							СоставныеРеквизиты.Добавить(Реквизит);
							Элемент.КнопкаОчистки = Истина;
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	
	ДобавляемыеРеквизиты.Добавить(ПутиРеквизитов);
	
	ОсновнойОбъект = ЭтаФорма.РеквизитФормыВЗначение("Объект");
	ТипОсновногоОбъекта = ТипЗнч(ОсновнойОбъект);
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипОсновногоОбъекта);
	
	Для каждого Язык Из Языки Цикл
		Если Язык.Ссылка <> ЯзыкПоУмолчанию Тогда
			НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
			НовыйРеквизит = Новый РеквизитФормы(НаименованиеРеквизита, Новый ОписаниеТипов(МассивТипов));
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		КонецЕсли; 
	КонецЦикла; 
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭтаФорма.дс_ПутиЛокализованныхРеквизитов 	= ЗначениеВСтрокуВнутр(сПутиРеквизитов);
	ЭтаФорма.дс_СоставныеРеквизиты 				= СтрСоединить(СоставныеРеквизиты, ",");
	// >> [Деснол] [Ушаков А.Д.] [25.10.2019] 
	ЭтаФорма.дс_СписокЛокализованныхРеквизитов 	= СтрСоединить(СтроковыеРеквизиты, ",");
	//ЭтаФорма.дс_СписокЛокализованныхРеквизитов 	= СтроковыеРеквизиты;
	// << [Деснол] [Ушаков А.Д.] [25.10.2019] 
КонецПроцедуры

Функция ПолучитьПереводыСтроковыхРеквизитов(Реквизиты, ЭтаФорма, Языки, ЯзыкПоУмолчанию)
	
	Переводы = Новый ТаблицаЗначений;
	Переводы.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250)));
	Переводы.Колонки.Добавить("Язык", Новый ОписаниеТипов("СправочникСсылка.торо_Языки"));
	Переводы.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	
	Для каждого Реквизит Из Реквизиты Цикл
		Для каждого Язык Из Языки Цикл
			НоваяСтрока = Переводы.Добавить();
			НоваяСтрока.Язык = Язык.Ссылка;
			НоваяСтрока.Реквизит = Реквизит;
			Если Язык.Ссылка = ЯзыкПоУмолчанию Тогда
				НоваяСтрока.Значение = ЭтаФорма.Объект[Реквизит];
			Иначе
				НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
				НоваяСтрока.Значение = ЭтаФорма[НаименованиеРеквизита][Реквизит];
			КонецЕсли; 
			Если ЗначениеЗаполнено(НоваяСтрока.Значение) = Ложь Тогда 
				НоваяСтрока.Значение = ЭтаФорма.Объект[Реквизит];
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	тПереводы.Реквизит КАК Реквизит,
	|	тПереводы.Язык КАК Язык,
	|	тПереводы.Значение КАК Значение
	|ПОМЕСТИТЬ тПереводы
	|ИЗ
	|	&тПереводы КАК тПереводы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тПереводы.Реквизит КАК Реквизит,
	|	тПереводы.Язык КАК Язык,
	|	ЕСТЬNULL(торо_Переводы.Текст, тПереводы.Значение) КАК Значение
	|ИЗ
	|	тПереводы КАК тПереводы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Переводы КАК торо_Переводы
	|		ПО тПереводы.Реквизит = торо_Переводы.Реквизит
	|			И тПереводы.Язык = торо_Переводы.Язык";

	#КонецОбласти 
	
	Запрос.УстановитьПараметр("тПереводы", Переводы);

	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьСтроковыеРеквизиты(Переводы, ЭтаФорма, Языки, ЯзыкПоУмолчанию)
	Для каждого Язык Из Языки Цикл
		Если Язык.Ссылка = ЯзыкПоУмолчанию Тогда
			НаименованиеРеквизита = "Объект";
		Иначе
			НаименованиеРеквизита = СтрШаблон("Объект_%1", Язык.Код);
		КонецЕсли; 
		
		Значения = Переводы.НайтиСтроки(Новый Структура("Язык", Язык.Ссылка));
		Для каждого Значение Из Значения Цикл
			ЭтаФорма[НаименованиеРеквизита][Значение.Реквизит] = Значение.Значение;
		КонецЦикла; 
	КонецЦикла; 
КонецПроцедуры

Функция ПолучитьЭлелементыСтроковыхРеквизитов(СтроковыеРеквизиты, ЭтаФорма)
	МассивПутей = Новый Массив;
	Для каждого Реквизит Из СтроковыеРеквизиты Цикл
		ПутьКРеквизиту = СтрШаблон("Объект.%1", Реквизит);
		МассивПутей.Добавить(ПутьКРеквизиту);
	КонецЦикла; 
	
	ЭлементыФормы = Новый Соответствие;
	
	Для каждого Элемент Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			Если МассивПутей.Найти(Элемент.ПутьКДанным) <> Неопределено Тогда
				ЭлементыФормы.Вставить(Элемент.ПутьКДанным, Элемент);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ЭлементыФормы;
КонецФункции

Процедура УстановитьДействияВыбора(ЭлементыФормы)
	Для каждого ЭлементФормы Из ЭлементыФормы Цикл
		Элемент = ЭлементФормы.Значение;
		Элемент.УстановитьДействие("НачалоВыбора", 		"дс_НачалоВыбора");
		Элемент.УстановитьДействие("ОбработкаВыбора", 	"дс_ОбработкаВыбора");
		Элемент.КнопкаВыбора = Истина;
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПоказатьДанные;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
